ИС_СПОРТ_2022/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДокументСоревнование</name>
      <description>Контактная информация документа &quot;Соревнование&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизаторыСоревнований</name>
      <description>Контактная информация справочника &quot;Организаторы соревнований&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРеестрУчебныхУчреждений</name>
      <description>Контактная информация справочника &quot;Реестр учебных учреждений&quot;</description>
    </items>
    <items>
      <name>СправочникСтраховыеКомпании</name>
      <description>Контактная информация справочника &quot;Страховые компании&quot;</description>
    </items>
    <items>
      <name>СправочникУчебныеУчреждения</name>
      <description>Контактная информация справочника &quot;Учебные учреждения&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
    <items>
      <name>СправочникМедицинскиеОрганизации</name>
      <description>Справочник медицинские организации</description>
    </items>
    <items>
      <name>СправочникРейтинги</name>
      <description>Справочник рейтинги</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьВводНекорректного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/CommonModules/ОбновлениеИнформационнойБазыБСП/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ИдентификаторИнтернетПоддержки - Строка - уникальное имя программы в сервисах Интернет-поддержки.
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "СтандартныеПодсистемы";
	Описание.Версия = "3.1.2.352";
	Описание.ИдентификаторИнтернетПоддержки = "SSL";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии = "2.3.3.0";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ИнтеграцияПодсистемБСП.ПриДобавленииОбработчиковОбновления(Обработчики);
	
	// {Рарус adilas #15718 -Вид контактной информации Сайт 2021.04.19
	// Обработчики, выполняемые при заполнении пустой ИБ.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБСП.СоздатьВидыКонтактнойИнформации";
	
	// Обработчики, выполняемые при заполнении пустой ИБ и при переходе на новую версию.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБСП.ОбновитьПредопределенныеВидыКонтактнойИнформации";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 99;	
	// }Рарус adilas #15718 -Вид контактной информации Сайт 2021.04.19
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПередОбновлениемИнформационнойБазы.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
		
	ИнтеграцияПодсистемБСП.ПослеОбновленияИнформационнойБазы(ПредыдущаяВерсия, ТекущаяВерсия,
		ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим);
		
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений.
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// {Рарус adilas #15718 -Вид контактной информации Сайт 2021.04.19
// Процедура обновления ИБ для справочника видов контактной информации
Процедура СоздатьВидыКонтактнойИнформации() Экспорт
	
	// Документ "Соревнование"
    ГруппаКонтактнойИнформацииДокументСоревнование     			= УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииДокументСоревнование.Имя 			= "ДокументСоревнование";
    ГруппаКонтактнойИнформацииДокументСоревнование.Наименование = НСтр("ru='Контактная информация документа Соревнование'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииДокументСоревнование);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ГородСоревнование";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// Справочник "ОрганизаторыСоревнований"
    ГруппаКонтактнойИнформацииСправочникОрганизаторыСоревнований     	= УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникОрганизаторыСоревнований.Имя 	= "СправочникОрганизаторыСоревнований";
    ГруппаКонтактнойИнформацииДокументСоревнование.Наименование 		= НСтр("ru='Контактная информация справочника Организаторы соревнований'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникОрганизаторыСоревнований);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ЮрАдресОрганизатораСоревнования";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ФактАдресОрганизатораСоревнования";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ПочтовыйАдресОрганизатораСорвенования";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонОрганизатораСоревнования";
    Вид.Порядок = 4;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
    Вид.Имя = "ФаксОрганизатораСоревнования";
    Вид.Порядок = 5;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailОрганизатораСоревнования";
    Вид.Порядок = 6;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// Справочник "СправочникОрганизации"
    ГруппаКонтактнойИнформацииСправочникОрганизации     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникОрганизации.Имя = "СправочникОрганизации";
    ГруппаКонтактнойИнформацииСправочникОрганизации.Наименование = НСтр("ru='Контактная информация справочника Организации'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникОрганизации);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ЮрАдресОрганизации";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ФактАдресОрганизации";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ПочтовыйАдресОрганизации";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонОрганизации";
    Вид.Порядок = 4;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
    Вид.Имя = "ФаксОрганизации";
    Вид.Порядок = 5;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailОрганизации";
    Вид.Порядок = 6;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
    Вид.Имя = "Сайт";
    Вид.Порядок = 7;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВвода";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
    Вид.Имя = "ДругаяИнформацияОрганизации";
    Вид.Порядок = 8;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// Справочник "СправочникПользователи"
    ГруппаКонтактнойИнформацииСправочникПользователи     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникПользователи.Имя = "СправочникПользователи";
    ГруппаКонтактнойИнформацииСправочникПользователи.Наименование = НСтр("ru='Контактная информация справочника Пользователи'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникПользователи);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонПользователя";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailПользователя";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);

	// Справочник "СправочникСтраховыеКомпании"
    ГруппаКонтактнойИнформацииСправочникСтраховыеКомпании     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникСтраховыеКомпании.Имя = "СправочникСтраховыеКомпании";
    ГруппаКонтактнойИнформацииСправочникСтраховыеКомпании.Наименование = НСтр("ru='Контактная информация справочника Страховые компании'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникСтраховыеКомпании);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ЮрАдресСтраховыеКомпании";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонСтраховыеКомпании";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailСтраховыеКомпании";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// Справочник "СправочникУчебныеУчреждения"
    ГруппаКонтактнойИнформацииСправочникУчебныеУчреждения     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникУчебныеУчреждения.Имя = "СправочникУчебныеУчреждения";
    ГруппаКонтактнойИнформацииСправочникУчебныеУчреждения.Наименование = НСтр("ru='Контактная информация справочника Учебные учреждения'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникУчебныеУчреждения);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ЮрАдресУчебныеУчреждения";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ФактАдресУчебныеУчреждения";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ПочтовыйАдресУчебногоУчреждения";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонУчебныеУчреждения";
    Вид.Порядок = 4;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
    Вид.Имя = "ФаксУчебныеУчреждения";
    Вид.Порядок = 5;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailУчебногоУчреждения";
    Вид.Порядок = 6;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
    Вид.Имя = "ДругаяИнформацияУчебныеУчреждения";
    Вид.Порядок = 7;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// {Рарус adilas #21295 -Реестр учебных учреждении. Контактная информация. 2021.10.11
	// Справочник "СправочникРеестрУчебныхУчреждений"
    ГруппаКонтактнойИнформацииСправочникРеестрУчебныхУчреждений     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникРеестрУчебныхУчреждений.Имя = "СправочникРеестрУчебныхУчреждений";
    ГруппаКонтактнойИнформацииСправочникРеестрУчебныхУчреждений.Наименование = НСтр("ru='Контактная информация справочника Реестр учебных учреждений'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникРеестрУчебныхУчреждений);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ЮрАдресРеестрУчебныхУчреждений";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ФактАдресРеестрУчебныхУчреждений";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ПочтовыйАдресРеестраУчебныхУчреждений";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонРеестрУчебныхУчреждений";
    Вид.Порядок = 4;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
    Вид.Имя = "ФаксРеестрУчебныхУчреждений";
    Вид.Порядок = 5;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailРеестраУчебныхУчреждений";
    Вид.Порядок = 6;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
    Вид.Имя = "ДругаяИнформацияРеестрУчебныхУчреждений";
    Вид.Порядок = 7;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
    // }Рарус adilas #21295 -Реестр учебных учреждении. Контактная информация. 2021.10.11
	
	// Справочник "СправочникФизическиеЛица"
    ГруппаКонтактнойИнформацииСправочникФизическиеЛица     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникФизическиеЛица.Имя = "СправочникФизическиеЛица";
    ГруппаКонтактнойИнформацииСправочникФизическиеЛица.Наименование = НСтр("ru='Контактная информация справочника Физические лица'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникФизическиеЛица);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "АдресПоПропискеФизическиеЛица";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "АдресМестаПроживанияФизическиеЛица";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонДомашнийФизическиеЛица";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонРабочийФизическиеЛица";
    Вид.Порядок = 4;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонМобильныйФизическиеЛица";
    Вид.Порядок = 5;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Вид.Имя = "EmailФизическогоЛица";
    Вид.Порядок = 6;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// Документ "СправочникРейтинги"
    ГруппаКонтактнойИнформацииСправочникРейтинги     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникРейтинги.Имя = "СправочникРейтинги";
    ГруппаКонтактнойИнформацииСправочникРейтинги.Наименование = НСтр("ru='Контактная информация документа Соревнование'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникРейтинги);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ГородРейтинги";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	// {Рарус adilas #22689 -Мед учреждение в допуске 2021.12.10
	// Справочник "СправочникМедицинскиеОрганизации"
    ГруппаКонтактнойИнформацииСправочникМедицинскиеОрганизации     = УправлениеКонтактнойИнформацией.ПараметрыГруппыВидаКонтактнойИнформации();
    ГруппаКонтактнойИнформацииСправочникМедицинскиеОрганизации.Имя = "СправочникМедицинскиеОрганизации";
    ГруппаКонтактнойИнформацииСправочникМедицинскиеОрганизации.Наименование = НСтр("ru='Контактная информация справочника Медицинские организации'");
    Группа = УправлениеКонтактнойИнформацией.УстановитьСвойстваГруппыВидаКонтактнойИнформации(ГруппаКонтактнойИнформацииСправочникМедицинскиеОрганизации);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ЮрАдресМедицинскиеОрганизации";
    Вид.Порядок = 1;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ФактАдресМедицинскиеОрганизации";
    Вид.Порядок = 2;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
    Вид.Имя = "ПочтовыйАдресМедицинскиеОрганизации";
    Вид.Порядок = 3;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
	
	Вид = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
    Вид.Имя = "ТелефонМедицинскиеОрганизации";
    Вид.Порядок = 4;
    Вид.Группа = Группа;
    Вид.МожноИзменятьСпособРедактирования = Истина;
	Вид.ВидРедактирования = "ПолеВводаИДиалог";
    УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(Вид);
    // }Рарус adilas #22689 -Мед учреждение в допуске 2021.12.10
	
КонецПроцедуры

// Вызывается при переходе на версию конфигурации.
//
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации() Экспорт
	
	//Содержимое справочника Виды контактной информации Предопределнные;
	// ДокументСоревнование
	ДокументСоревнование = Справочники.ВидыКонтактнойИнформации.ДокументСоревнование.ПолучитьОбъект();
	ДокументСоревнование.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументСоревнование);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ГородСоревнование;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// СправочникОрганизаторыСоревнований
	СправочникОрганизаторыСоревнований = Справочники.ВидыКонтактнойИнформации.СправочникОрганизаторыСоревнований.ПолучитьОбъект();
	СправочникОрганизаторыСоревнований.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОрганизаторыСоревнований);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизатораСоревнования;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизатораСоревнования;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизатораСорвенования;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизатораСоревнования;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксОрганизатораСоревнования;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	 
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизатораСоревнования;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// СправочникОрганизации
	СправочникОрганизации = Справочники.ВидыКонтактнойИнформации.СправочникОрганизации.ПолучитьОбъект();
	СправочникОрганизации.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОрганизации);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.Сайт;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВвода";
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	 
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 7;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 8;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// СправочникПользователи
	СправочникПользователи = Справочники.ВидыКонтактнойИнформации.СправочникПользователи.ПолучитьОбъект();
	СправочникПользователи.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникПользователи);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	 
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	// СправочникСтраховыеКомпании
	СправочникСтраховыеКомпании = Справочники.ВидыКонтактнойИнформации.СправочникСтраховыеКомпании.ПолучитьОбъект();
	СправочникСтраховыеКомпании.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникСтраховыеКомпании);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресСтраховыеКомпании;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСтраховыеКомпании;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	 
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailСтраховыеКомпании;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// СправочникУчебныеУчреждения
	СправочникУчебныеУчреждения = Справочники.ВидыКонтактнойИнформации.СправочникУчебныеУчреждения.ПолучитьОбъект();
	СправочникУчебныеУчреждения.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникУчебныеУчреждения);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресУчебныеУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресУчебныеУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресУчебногоУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонУчебныеУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксУчебныеУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	 
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailУчебногоУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияУчебныеУчреждения;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 7;                                            
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// {Рарус adilas #21295 -Реестр учебных учреждении. Контактная информация. 2021.10.11
	// Справочник "СправочникРеестрУчебныхУчреждений"
	СправочникРеестрУчебныхУчреждений = Справочники.ВидыКонтактнойИнформации.СправочникРеестрУчебныхУчреждений.ПолучитьОбъект();
	СправочникРеестрУчебныхУчреждений.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникРеестрУчебныхУчреждений);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресРеестрУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресРеестрУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресРеестраУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеестрУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФаксРеестрУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	 
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailРеестраУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияРеестрУчебныхУчреждений;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 7;                                            
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
    // }Рарус adilas #21295 -Реестр учебных учреждении. Контактная информация. 2021.10.11
	
	// СправочникФизическиеЛица
	СправочникФизическиеЛица = Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица.ПолучитьОбъект();
	СправочникФизическиеЛица.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникФизическиеЛица);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 5;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица;
	ПараметрыВида.Используется = Истина;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 6;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// СправочникРейтинги
	СправочникРейтинги = Справочники.ВидыКонтактнойИнформации.СправочникРейтинги.ПолучитьОбъект();
	СправочникРейтинги.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникРейтинги);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ГородРейтинги;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// {Рарус adilas #22689 -Мед учреждение в допуске 2021.12.08
	// Справочник "СправочникМедицинскиеОрганизации"
	СправочникМедицинскиеОрганизации = Справочники.ВидыКонтактнойИнформации.СправочникМедицинскиеОрганизации.ПолучитьОбъект();
	СправочникМедицинскиеОрганизации.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникМедицинскиеОрганизации);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресМедицинскиеОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресМедицинскиеОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресМедицинскиеОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 3;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонМедицинскиеОрганизации;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.ВидРедактирования = "ПолеВводаИДиалог";
	ПараметрыВида.Порядок = 4;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	// }Рарус adilas #22689 -Мед учреждение в допуске 2021.12.08
	
КонецПроцедуры
// }Рарус adilas #15718 -Вид контактной информации Сайт 2021.04.19

#КонецОбласти
